# by luffycity.com

# print(3+5+6)
# print((3+5+6)*12)
# print(((3+5+6)*12)+3)
# print((((3+5+6)*12)+3)/45)
#
# a = 3+5+6 # 这里的a就是一个变量. 临时记录一个值. 供后面的程序继续使用执行
# print(a*12) # 用完了
#
# a = "alex"
# print(a)
#
# a = 23
# print(a)
#
# b = a   # 执行顺序. 把等号右边的值赋值给等号左边的变量
#
# print(b)

# a = 20
# b = a
# a = 30
# print(b)


# 变量的命名规则:
#   1. 由字母, 数字, 下划线组成
#   2. 不能用纯数字. 也不能是数字开头
#   3. 不能是python的关键字
#   4. 不要太长
#   5. 要有意义
#   6. 区分大小写
#   7. 不要用中文(规范)
#   8. 推荐使用驼峰或下划线命名

# a = 10
# print(a / 3)
#
# a = "alex"
# print(a / 3)

# 变量的数据类型(3个)
# 1. int类型. 整数, 可以进行+,-,*,/,%(计算余数, 取模), //(整除)
# print(9223372036854775807 * 128)
# print(10%3)
# print(10//3)
# print(10/3) # 1-10000000000,0-1

# 2. str 字符串, ',",''',""" 阔气来的内容叫字符串
# alex = """黑吃"""
# # type()来查看变量的数据类型
# # alex = 18
# print(type(alex))
#
# s = '''对面的女孩看过来
# 看过来啊看过来
# 峰哥已经很难耐
# 安排'''
# print(s)

'''
注释: 多行注释.
'''

"""
注释: 多行注释. 不会影响你的程序执行. 给人看的. 
"""

# # 字符串可以进行的操作: + *
# print("马化腾"+"马云")
# print("马化腾"+2) # 会报错.  字符串和int不是一回事儿
#
# print("马化腾"*10)
#

# 3.bool 布尔. 真命题或者假命题, True,False. 只能用来条件的判断










